CSI API ETABS v1
cDiaphragm Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDiaphragm
Public Interface cDiaphragm
Dim instance As cDiaphragm
public interface class cDiaphragm
type cDiaphragm =  interface end
The cDiaphragm type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of a defined diaphragm
Delete
 Deletes the specified diaphragm
GetDiaphragm
 Retrieves the specified diaphragm
GetNameList
 Retrieves the names of all defined diaphragms
SetDiaphragm
 Adds a new diaphragm, or modifies an existing diaphragm
Top
See Also
Reference
ETABSv1 Namespace